In [2]:
#Welcome to Pandas
import pandas as pd

In [2]:
# Series
a=pd.Series([1,2,3,4,5,6,7,8,9])
print(a)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [ ]:
a.add(10)
print(a)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [11]:
c=pd.Series([1,2,3,4,5,6,7,8,9])
print(c)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [13]:
print(c.add(10))
print(c)

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
dtype: int64
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [14]:
c = c.add(10)
print(c)

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
dtype: int64

In [15]:
print(c.name)

None

In [16]:
c.name="Aakash"

In [17]:
print(c.name)

Aakash

In [18]:
# Dataframe
data = {'Name': ['Aakash', 'Rahul', 'Ankit', 'Rohit'],
        'Age': [23, 24, 21, 22],
        'City': ['Delhi', 'Mumbai', 'Bangalore', 'Chennai']}
df = pd.DataFrame(data)
print(df)

     Name  Age       City
0  Aakash   23      Delhi
1   Rahul   24     Mumbai
2   Ankit   21  Bangalore
3   Rohit   22    Chennai

In [3]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A','B','C'])
print(df)
print(df['A'])
print(df.A)
print(df[['A','B']])

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9
0    1
1    4
2    7
Name: A, dtype: int64
0    1
1    4
2    7
Name: A, dtype: int64
   A  B
0  1  2
1  4  5
2  7  8

In [4]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes
None

In [5]:
print(df.head().values.tolist())

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [10]:
print(df.head())
print(df.describe())
print(df.tail())

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9
         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
#Loading Csv file
df=pd.read_csv('Data/dominose.csv')

In [4]:
print(df)

          day       pizza type  unit sold
0      Monday       Margherita         45
1     Tuesday        Pepperoni         67
2   Wednesday         Hawaiian         32
3    Thursday   Veggie Supreme         28
4      Friday      Meat Lovers         89
5    Saturday      BBQ Chicken         76
6      Sunday      Four Cheese         54
7      Monday        Pepperoni         52
8     Tuesday       Margherita         38
9   Wednesday  Buffalo Chicken         41
10   Thursday         Hawaiian         29
11     Friday   Veggie Supreme         35
12   Saturday       Margherita         68
13     Sunday        Pepperoni         83
14     Monday      Meat Lovers         47
15    Tuesday      BBQ Chicken         39
16  Wednesday      Four Cheese         44
17   Thursday       Margherita         56
18     Friday         Hawaiian         33
19   Saturday        Pepperoni         91

In [5]:
df.head()

         day      pizza type  unit sold
0     Monday      Margherita         45
1    Tuesday       Pepperoni         67
2  Wednesday        Hawaiian         32
3   Thursday  Veggie Supreme         28
4     Friday     Meat Lovers         89

In [6]:
df.head(2)

       day  pizza type  unit sold
0   Monday  Margherita         45
1  Tuesday   Pepperoni         67

In [7]:
df.tail()

          day   pizza type  unit sold
15    Tuesday  BBQ Chicken         39
16  Wednesday  Four Cheese         44
17   Thursday   Margherita         56
18     Friday     Hawaiian         33
19   Saturday    Pepperoni         91

In [8]:
df.sample(5)

         day      pizza type  unit sold
10  Thursday        Hawaiian         29
3   Thursday  Veggie Supreme         28
4     Friday     Meat Lovers         89
0     Monday      Margherita         45
5   Saturday     BBQ Chicken         76

In [9]:
df.head(2)

       day  pizza type  unit sold
0   Monday  Margherita         45
1  Tuesday   Pepperoni         67

In [10]:
#loc and iloc
df.loc[0:5]

         day      pizza type  unit sold
0     Monday      Margherita         45
1    Tuesday       Pepperoni         67
2  Wednesday        Hawaiian         32
3   Thursday  Veggie Supreme         28
4     Friday     Meat Lovers         89
5   Saturday     BBQ Chicken         76

In [11]:
df.loc['day':'pizza type']

Empty DataFrame
Columns: [day, pizza type, unit sold]
Index: []

In [12]:
df.iloc[0:5]

         day      pizza type  unit sold
0     Monday      Margherita         45
1    Tuesday       Pepperoni         67
2  Wednesday        Hawaiian         32
3   Thursday  Veggie Supreme         28
4     Friday     Meat Lovers         89

In [ ]:
df.loc[:,'day']

0        Monday
1       Tuesday
2     Wednesday
3      Thursday
4        Friday
5      Saturday
6        Sunday
7        Monday
8       Tuesday
9     Wednesday
10     Thursday
11       Friday
12     Saturday
13       Sunday
14       Monday
15      Tuesday
16    Wednesday
17     Thursday
18       Friday
19     Saturday
Name: day, dtype: object

In [16]:
df.iloc[:,0]

0        Monday
1       Tuesday
2     Wednesday
3      Thursday
4        Friday
5      Saturday
6        Sunday
7        Monday
8       Tuesday
9     Wednesday
10     Thursday
11       Friday
12     Saturday
13       Sunday
14       Monday
15      Tuesday
16    Wednesday
17     Thursday
18       Friday
19     Saturday
Name: day, dtype: object

In [17]:
df.iloc[0:5,0:2]

         day      pizza type
0     Monday      Margherita
1    Tuesday       Pepperoni
2  Wednesday        Hawaiian
3   Thursday  Veggie Supreme
4     Friday     Meat Lovers

In [26]:
#Filtering
df['day']=='Monday'
df[df['day']=='Monday']
df[df['unit sold']>10]
df[(df['day']=='Monday') & (df['unit sold']>10)]
df[(df['day']=='Monday') & (df['unit sold']>10)]
df[df['day'].isin(['Monday','Tuesday'])]

        day   pizza type  unit sold
0    Monday   Margherita         45
1   Tuesday    Pepperoni         67
7    Monday    Pepperoni         52
8   Tuesday   Margherita         38
14   Monday  Meat Lovers         47
15  Tuesday  BBQ Chicken         39

In [31]:
#Adding and deleting columns
print(len(df))

20

In [32]:
import numpy as np
df['new_prices_per_unit']=np.arange(1,21)

In [33]:
df

          day       pizza type  unit sold  new_prices_per_unit
0      Monday       Margherita         45                    1
1     Tuesday        Pepperoni         67                    2
2   Wednesday         Hawaiian         32                    3
3    Thursday   Veggie Supreme         28                    4
4      Friday      Meat Lovers         89                    5
5    Saturday      BBQ Chicken         76                    6
6      Sunday      Four Cheese         54                    7
7      Monday        Pepperoni         52                    8
8     Tuesday       Margherita         38                    9
9   Wednesday  Buffalo Chicken         41                   10
10   Thursday         Hawaiian         29                   11
11     Friday   Veggie Supreme         35                   12
12   Saturday       Margherita         68                   13
13     Sunday        Pepperoni         83                   14
14     Monday      Meat Lovers         47                   15
15    Tuesday      BBQ Chicken         39                   16
16  Wednesday      Four Cheese         44                   17
17   Thursday       Margherita         56                   18
18     Friday         Hawaiian         33                   19
19   Saturday        Pepperoni         91                   20

In [34]:
df['new_prices_per_unit']=np.where(df['pizza type']=='Margherita',99,120)

In [41]:
df['new_prices_per_unit'] = df['pizza type'].map({
    'Margherita': 99,
    'Pepperoni': 150,
    'Veggie': 120,
    'BBQ Chicken': 180,
    'Meat Lovers': 200,
    'Hawaiian': 160,
    'Buffalo Chicken': 190,
    'Meat Lovers': 200,
    'Veggie Supreme': 210,
    'Four Cheese': 170,
})

In [42]:
df

          day       pizza type  unit sold  new_prices_per_unit
0      Monday       Margherita         45                   99
1     Tuesday        Pepperoni         67                  150
2   Wednesday         Hawaiian         32                  160
3    Thursday   Veggie Supreme         28                  210
4      Friday      Meat Lovers         89                  200
5    Saturday      BBQ Chicken         76                  180
6      Sunday      Four Cheese         54                  170
7      Monday        Pepperoni         52                  150
8     Tuesday       Margherita         38                   99
9   Wednesday  Buffalo Chicken         41                  190
10   Thursday         Hawaiian         29                  160
11     Friday   Veggie Supreme         35                  210
12   Saturday       Margherita         68                   99
13     Sunday        Pepperoni         83                  150
14     Monday      Meat Lovers         47                  200
15    Tuesday      BBQ Chicken         39                  180
16  Wednesday      Four Cheese         44                  170
17   Thursday       Margherita         56                   99
18     Friday         Hawaiian         33                  160
19   Saturday        Pepperoni         91                  150